BRANDS=("别克" "奥迪" "一汽丰田" "沃尔沃" "东风本田" "上汽大众" "宝马" "日产" "广汽本田" "一汽大众" "福特" "起亚" "别克" "一汽丰田" "东风本田" "上汽大众" "宝马" "日产" "广汽本田" "一汽大众" "福特" "奥迪" "起亚" "别克" "凯迪拉克" "一汽丰田" "雪佛兰" "广汽丰田" "上汽大众" "奔驰" "宝马" "日产" "广汽本田" "一汽大众" "福特" "奥迪" "起亚" "别克" "雷克萨斯" "一汽丰田" "广汽丰田" "上汽大众" "奔驰" "一汽大众" "福特" "别克" "路虎" "一汽丰田" "上汽大众" "一汽大众" "别克" "一汽丰田")

SERSES=("凯越" "奥迪A6L" "卡罗拉" "沃尔沃XC60" "本田CR-V" "帕萨特" "宝马5系" "天籁" "雅阁" "捷达" "嘉年华" "赛拉图" "别克GL8" "普拉多" "思域" "大众POLO" "宝马3系" "轩逸" "飞度" "宝来" "蒙迪欧" "奥迪A4L" "起亚K2" "君威" "凯迪拉克XTS" "锐志" "科鲁兹" "凯美瑞" "朗逸" "奔驰E级" "宝马X5" "骐达" "奥德赛" "速腾" "福克斯" "奥迪Q5" "狮跑" "君越" "雷克萨斯ES" "威驰" "汉兰达" "桑塔纳" "奔驰C级" "迈腾" "致胜" "英朗XT" "揽胜极光" "丰田RAV4" "途观" "高尔夫" "昂科威" "皇冠")

declare -i n
n=${#BRANDS[@]}
n=$n-1
echo $n
for i in $(seq 0 $n);  do

 b=${BRANDS[$i]}
 s=${SERSES[$i]}

 # do something....
 sh -x test.sh $b $s
done


